uhnp/src/Documents/УстановкаОбщихТребованийКПоставщикам/УстановкаОбщихТребованийКПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаОбщихТребованийКПоставщикам</name>
  <registerRecords>InformationRegister.ОбщиеКвалификационныеТребованияКПоставщикам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Требования</name>
    <attributes>
      <name>ТребованиеКПоставщику</name>
      <type>
        <types>CatalogRef.ТребованияКПоставщикам</types>
      </type>
    </attributes>
    <attributes>
      <name>Критерий</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеКДокументу</name>
      <type>
        <types>CatalogRef.ТребованияКСоставуДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ОбщиеКвалификационныеТребованияКПоставщикам/ОбщиеКвалификационныеТребованияКПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбщиеКвалификационныеТребованияКПоставщикам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Критерий</name>
    <type>
      <types>CatalogRef.КритерииВыбора</types>
    </type>
  </resources>
  <resources>
    <name>ТребованиеКДокументу</name>
    <type>
      <types>CatalogRef.ТребованияКСоставуДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТребованиеКПоставщику</name>
    <type>
      <types>CatalogRef.ТребованияКПоставщикам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/УстановкаОбщихТребованийКПоставщикам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОбщиеКвалификационныеТребованияКПоставщикам.Записывать = Истина;
	Для Каждого ТекСтрокаТребования Из Требования Цикл
		Движение = Движения.ОбщиеКвалификационныеТребованияКПоставщикам.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТребованиеКПоставщику = ТекСтрокаТребования.ТребованиеКПоставщику;
		Движение.Критерий = ТекСтрокаТребования.Критерий;
		Движение.ТребованиеКДокументу = ТекСтрокаТребования.ТребованиеКДокументу;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
